read_verilog -sv simple.v
prep -top simple

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_smt2 -mem -bv -wires -stdt simple.smt2
