read_verilog -sv simple.v
prep -top simple

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_smv simple.smv
