read_verilog experiment_orig.v

prep -top exp

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
memory -nordff
proc
opt;;
opt_clean
write_verilog -nohex experiment.v
