read_verilog -sv word_adder_clean.v
prep -top word_adder

hierarchy -check
setattr -mod -set keep_hierarchy 1 adder
proc
opt
opt_expr -mux_undef
opt
flatten
memory -nordff
proc
opt;;
write_verilog -noattr word_adder_yosys.v
