read_verilog -sv mult.v
prep -top mult

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_btor mult.btor
