read_verilog -sv design.v
prep -top word_adder

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_smt2 design.smt2
