read_verilog -sv word_adder_clean.v
prep -top word_adder

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_verilog word_adder_yosys.v
