read_verilog aes_128.v
read_verilog expand_key_128.v
read_verilog final_round.v
read_verilog one_round.v
read_verilog table_lookup.v
read_verilog reg16byte.v
read_verilog reg2byte.v
read_verilog reg32byte.v
read_verilog reg256byte.v
read_verilog S.v
read_verilog T.v
read_verilog xS.v

read_verilog S4.v


prep -top aes_128

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
memory -nordff
proc
opt;;
write_verilog -nohex aes_128_yosys.v
