read_verilog -sv ../rtl/vpipe.v

prep -top pipeline_v

hierarchy -check
proc
opt
opt_expr -mux_undef
proc
opt;;
write_verilog -nohex vpipe_yosys.v
