read_verilog -sv advanced.v
prep -top advanced

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_verilog design.v
