read_verilog -sv naive.v
prep -top naive

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_verilog naive_yosys.v
