read_verilog -sv accum.v
prep -top accum 

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_verilog -noattr -nohex accum_yosys.v
