read_verilog -sv accum.v
read_verilog -sv adder.v
prep -top accum 

hierarchy -check
setattr -mod -set keep_hierarchy 1 adder
proc
opt
opt_expr -mux_undef
opt
memory -nordff
proc
opt;;
write_verilog -noattr -nohex accum_yosys.v
