read_verilog -sv ../rtl/reg32byte.v

prep -top reg32byte

hierarchy -check
proc
opt
opt_expr -mux_undef
memory_dff -wr_only
memory_collect;
memory_unpack
splitnets -driver
opt;;
memory_collect;
pmuxtree

opt
proc
opt;;
write_verilog -nohex reg32byte_yosys.v
