read_verilog -sv reg32byte_NEW.v.clean.tainted.final
prep -top reg32byte

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
