read_verilog -sv two_reg.v
prep -top two_reg

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
memory -nordff
proc
opt;;
write_verilog two_reg_yosys.v
