read_verilog /workspace/research/ILA/autoGenILA/AES/Verilog/one_round.v
read_verilog /workspace/research/ILA/autoGenILA/AES/Verilog/table_lookup.v
read_verilog /workspace/research/ILA/autoGenILA/AES/Verilog/S.v
read_verilog /workspace/research/ILA/autoGenILA/AES/Verilog/T.v
read_verilog /workspace/research/ILA/autoGenILA/AES/Verilog/xS.v
read_verilog /workspace/research/ILA/autoGenILA/AES/Verilog/S4.v

prep -top one_round

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
flatten
memory -nordff
proc
opt;;
write_verilog -nohex -noattr design.v
