read_verilog -sv word_adder.v
prep -top word_adder

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_btor word_adder.btor
