read_verilog  word_adder_clean.v
prep -top word_adder

hierarchy -check
proc
opt
opt_expr -mux_undef
flatten;
memory -nordff
opt;;
write_verilog word_adder_yosys2.v
