read_verilog -sv ./Verilog/mem_rbm_0_cmos32soi_rtl.v
read_verilog -sv ./Verilog/rbm_0_cmos32soi_rtl.v
read_verilog -sv ./Verilog/top_rbm_0_cmos32soi_rtl.v
prep -top rbm_0_top_cmos32soi_rtl

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_verilog rbm_yosys.v
