read_verilog -sv two_reg_yosys.v.clean
prep -top two_reg

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_smt2 design.smt2
