read_verilog ../RTL/16x16bit_multiplier_pipelined.v
read_verilog ../RTL/booth.v
read_verilog ../RTL/CLA_fixed.v
read_verilog ../RTL/PID_defines.v
read_verilog ../RTL/PID.v

prep -top PID

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
flatten
memory -nordff
proc
opt;;
opt_clean
write_verilog -nohex PID_flatten.v
