read_verilog -sv sha_simp.v.clean.tainted.final
prep -top sha_top

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
