read_verilog -sv simple_write_first.v
prep -top simple

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_btor simple_write_first.btor
