read_verilog -sv ../rtl/reg16byte.v
read_verilog -sv ../rtl/reg256byte.v
read_verilog -sv ../rtl/reg2byte.v
read_verilog -sv ../rtl/reg32byte.v
read_verilog -sv ../rtl/sha1_core.v
read_verilog -sv ../rtl/sha1_w_mem.v

prep -top sha1_core

hierarchy -check
proc
opt
opt_expr -mux_undef
proc
opt;;
write_verilog -nohex sha_simp.v
