read_verilog -sv expand_key_128.v
read_verilog -sv S.v
read_verilog -sv S4.v
prep -top expand_key_128

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
flatten;
memory -nordff
proc
opt;;
write_verilog design.v
